" ------------------------------------------------------
" --- 基本 ---
" ------------------------------------------------------
"Vi互換をオフ
set nocompatible
"文字コード（エンコーディング）
set encoding=utf-8
set fileencodings=iso-2022-jp,euc-jp,sjis,utf-8
"シンタックスハイライトを有効にする
syntax on

" ------------------------------------------------------
" --- マウス操作 ---
" ------------------------------------------------------
"マウス操作の有効化
set mouse=a
"screen経由でもマウスを有効化
set ttymouse=xterm2

" ------------------------------------------------------
" --- カーソル移動 ---
" ------------------------------------------------------
"カーソルを行頭、行末で止まらないようにする
set whichwrap=b,s,h,l,<,>,[,]

" ------------------------------------------------------
" --- 編集 ---
" ------------------------------------------------------
"行番号を表示する
set number
"新しい行のインデントを現在行と同じにする
set autoindent
"バックスペースでインデントや改行を削除できるようにする
"indent:行頭の空白, eol:改行, start:挿入モード開始位置より手前の文字
set backspace=indent,eol,start
"タブの文字数(タブストップ)を設定する
set tabstop=4
"タブの代わりに空白文字を挿入する
"set expandtab
"シフト移動幅
set shiftwidth=4
"クリップボードをWindowsと連携
set clipboard=unnamed

" ------------------------------------------------------
" --- 検索 ---
" ------------------------------------------------------
"検索時に大文字小文字を無視する
set ignorecase
"大文字を混ぜて検索した場合だけ大文字/小文字を区別する
set smartcase
"検索文字を打ち込むと即検索する（インクリメンタルサーチ）
set incsearch
"検索結果をハイライトする
set hlsearch
"検索時にファイルの最後まで行ったら最初に戻らないようにする
set nowrapscan

" ------------------------------------------------------
" --- 見た目 ---
" ------------------------------------------------------
"タイトルをウィンドウ枠に表示する
set title
"ルーラーを表示する
set ruler
"カーソル行の強調表示
"set cursorline
"タブ文字、行末など不可視文字を表示する
"set list
"listで表示される文字のフォーマットを指定する
"set listchars=eol:$,tab:>\ ,extends:<

" ------------------------------------------------------
" --- コマンドライン ---
" ------------------------------------------------------
"コマンドライン補完するときに補完候補を表示する
set wildmenu
"ステータスラインに表示される文字を変更する
"set statusline=%F%M%R%=code:%B%H%W
"常にステータスラインを表示
set laststatus=2
"コマンドをステータスラインに表示
set showcmd

" ------------------------------------------------------
" --- バックアップ ---
" ------------------------------------------------------
"バックアップをとらない
"set nobackup
"バックアップをとる
set backup
"バックアップファイルの作られるディレクトリを指定する
set backupdir=$HOME/backup/vim
set backupext=.back
"スワップファイルが作られるディレクトリを指定する
let &directory=&backupdir

" ------------------------------------------------------
" --- ファイル・ディレクトリ操作 ---
" ------------------------------------------------------
"フルパスを指定せずに、ファイル名だけでファイルを開けるようにする
"let &path+="dir"

" ------------------------------------------------------
" --- プログラミング支援 ---
" ------------------------------------------------------
"括弧の入力時にカーソルを対応する括弧の上に一定時間表示させる
set showmatch
"このオプションの値が、マッチした括弧の始めを表示する時間(1/10秒)になる
set matchtime=3
"目的の関数へタグジャンプをする
"set tags=./tags,/usr/src/tags
"カレントディレクトリから親ディレクトリを遡ってtagsファイルを検索する
set tags+=tags;
"逆に、カレントディレクトリ以下を再帰的に検索する
"set tags+=./**/tags

" ------------------------------------------------------
" --- オリジナルキーマップ ---
" ------------------------------------------------------
"ESCで挿入モードを抜けるときにIMEもオフにする
inoremap <ESC> <ESC>:set iminsert=0<CR>					"うまくいかない
"スペースキーでスクロールできるようにする
nnoremap <Space> jzz
nnoremap <S-Space> kzz
"ノーマルモードでEnterキーを押したときに、改行する
"nnoremap <CR> s-o<ESC>									"うまくいかない
"Ctrl+Tab, Ctrl+Shift+Tabでタブ切り替え
nnoremap <C-Tab> gt										"うまくいかない
nnoremap <C-S-Tab> gT									"うまくいかない
"vimgrepで自動的にQuickWindowsを開く
au QuickfixCmdPost vimgrep cw

" ------------------------------------------------------
" --- プラグイン用設定 ---
" ------------------------------------------------------
" -----------------------------
" --- for NERDTree ---
" -----------------------------
"隠しファイルを表示する
let NERDTreeShowHidden=1
"カーソル行を強調表示しない
let NERDTreeHighlightCursorline=0

