" ------------------------------------------------------
" --- 基本 ---
" ------------------------------------------------------
"Vi互換をオフ
"set nocompatible
"シンタックスハイライトを有効にする
syntax enable

" ------------------------------------------------------
" --- カーソル移動 ---
" ------------------------------------------------------
"カーソルを行頭、行末で止まらないようにする
set whichwrap=b,s,h,l,<,>,[,]

" ------------------------------------------------------
" --- 編集 ---
" ------------------------------------------------------
"行番号を表示する
set number
"新しい行のインデントを現在行と同じにする
set autoindent
"バックスペースでインデントや改行を削除できるようにする
set backspace=indent,eol,start
"タブの文字数(タブストップ)を設定する
set tabstop=4
"タブの代わりに空白文字を挿入する
"set expandtab
"シフト移動幅
set shiftwidth=4
"クリップボードをWindowsと連携
set clipboard=unnamed

" ------------------------------------------------------
" --- 検索 ---
" ------------------------------------------------------
"検索時に大文字小文字を無視する
set ignorecase
"大文字を混ぜて検索した場合だけ大文字/小文字を区別する
set smartcase
"検索文字を打ち込むと即検索する（インクリメンタルサーチ）
set incsearch
"検索結果をハイライトする
set hlsearch
"検索時にファイルの最後まで行ったら最初に戻らないようにする
set nowrapscan

" ------------------------------------------------------
" --- 見た目 ---
" ------------------------------------------------------
"タブ文字、行末など不可視文字を表示する
"set list
"listで表示される文字のフォーマットを指定する
"set listchars=eol:$,tab:>\ ,extends:<

" ------------------------------------------------------
" --- コマンドライン ---
" ------------------------------------------------------
"コマンドライン補完するときに補完候補を表示する
set wildmenu
"ステータスラインに表示される文字を変更する
"set statusline=%F%M%R%=code:%B%H%W

" ------------------------------------------------------
" --- バックアップ ---
" ------------------------------------------------------
"バックアップファイルの作られるディレクトリを指定する
set backupdir=$HOME/backup/vim
set backupext=.back
"スワップファイルが作られるディレクトリを指定する
let &directory=&backupdir

" ------------------------------------------------------
" --- ファイル・ディレクトリ操作 ---
" ------------------------------------------------------
"フルパスを指定せずに、ファイル名だけでファイルを開けるようにする
"let &path+="dir"

" ------------------------------------------------------
" --- プログラミング支援 ---
" ------------------------------------------------------
"括弧の入力時にカーソルを対応する括弧の上に一定時間表示させる
set showmatch
"このオプションの値が、マッチした括弧の始めを表示する時間(1/10秒)になる
set matchtime=3
"目的の関数へタグジャンプをする
"set tags=./tags,/usr/src/tags

